# Exercises (DIY) - Part 1

In this exercise we try to merge information from two data sources that share a common key. 

The first file passengerData.csv contains information of 891 passengers on a ship. 

The second file ticketPrices.xlsx contains just the look up values for the ticket prices for the trip in British Pounds. 

The two files share a common column called TicketType that can be used to link them. Try doing the following tasks:

In [4]:
# Import pandas library
import pandas as pd

## Data loading
Let's look at two data files.

In [5]:
file1 = pd.read_csv("ticketPrices.csv")
file1.head()

   TicketType  Fare
0           1    33
1           2    56
2           3    77
3           4    22
4           5    14

In [7]:
file2 = pd.read_csv("passengerData.csv")
file2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,TicketType
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,3
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,4
4,5,0,3,"Allen, Mr. William Henry",male,35.0,5